In [1]:
import pandas as pd

In [23]:
# 'train.csv' dosyasını okuyup 'df' (Data Frame) adında bir değişkene ata
df = pd.read_csv('data/train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# Veriyi 'Sex' (Cinsiyet) sütununa göre grupla,
# sonra sadece 'Survived' (Hayatta Kalma) sütununu seç,
# ve bu grupların ortalamasını al.
# (Hayatta kalma 1, kalmama 0 olduğu için ortalaması bize hayatta kalma oranını verir)

df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [5]:
# Veriyi 'Pclass' (Bilet Sınıfı) sütununa göre grupla,
# 'Survived' sütununu seç,
# ve bu grupların ortalamasını al.

df.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [6]:
# Veriyi ÖNCE 'Pclass' (Sınıf), SONRA 'Sex' (Cinsiyet) sütununa göre grupla,
# 'Survived' sütununu seç,
# ve bu alt grupların ortalamasını al.

df.groupby(['Pclass', 'Sex'])['Survived'].mean()

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

In [7]:
# 'Survived' (0 = Hayır, 1 = Evet) durumuna göre grupla
# 'Age' (Yaş) sütununun ortalamasını al

df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [8]:
# Yaş kategorisi oluşturalım: 0-18 arası "Child", 18-100 arası "Adult"
# right=False parametresi, 18 yaşının "Adult" grubuna dahil olmasını sağlar.
df['AgeCategory'] = pd.cut(df['Age'], bins=[0, 18, 100], labels=['Child', 'Adult'], right=False)

In [10]:
# 9. Hücrenin güncellenmiş hali
# Sadece observed=True parametresini ekliyoruz

df.groupby('AgeCategory', observed=True)['Survived'].mean()

AgeCategory
Child    0.539823
Adult    0.381032
Name: Survived, dtype: float64

In [11]:

# Not: .unstack() komutu, tabloyu daha okunaklı hale getirir (opsiyoneldir ama güzel görünür)

# 10. Hücrenin güncellenmiş hali

df.groupby(['Pclass', 'Sex', 'AgeCategory'], observed=True)['Survived'].mean().unstack()

AgeCategory       Child     Adult
Pclass Sex
1      female  0.875000  0.974026
       male    1.000000  0.371134
2      female  1.000000  0.903226
       male    0.818182  0.068182
3      female  0.542857  0.417910
       male    0.232558  0.133333

In [12]:
# 'Age' sütununun ortalamasını hesapla
ortalama_yas = df['Age'].mean()

# 'Age' sütunundaki tüm NaN (boş) değerleri bu ortalama yaş ile doldur
df['Age'] = df['Age'].fillna(ortalama_yas)

# Kontrol edelim: Artık Age sütununda hiç boşluk kaldı mı?
# (Çıktının 0 olması lazım)
print("Kalan boş 'Age' sayısı:", df['Age'].isnull().sum())

Kalan boş 'Age' sayısı: 0

In [13]:
# 'Sex' sütununu 'female' ise 1, 'male' ise 0 yap
df['Sex_numeric'] = df['Sex'].map({'female': 1, 'male': 0})

# Yeni sütunumuza bakalım
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeCategory,Sex_numeric
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Adult,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult,0

In [14]:
# Modelin bakacağı özelliklerin (sütunların) listesi
features = ['Pclass', 'Age', 'Sex_numeric']

# X'i (Özellikler) ve y'yi (Hedef) tanımla
X = df[features]
y = df['Survived']

# Hızlıca bakalım ne seçtik
print("--- Kâhinin bakacağı veriler (X) ---")
print(X.head())
print("\n--- Kâhinin tahmin edeceği cevaplar (y) ---")
print(y.head())

--- Kâhinin bakacağı veriler (X) ---
   Pclass   Age  Sex_numeric
0       3  22.0            0
1       1  38.0            1
2       3  26.0            1
3       1  35.0            1
4       3  35.0            0

--- Kâhinin tahmin edeceği cevaplar (y) ---
0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [15]:
from sklearn.tree import DecisionTreeClassifier

# Kâhinimizi (modelimizi) oluşturuyoruz
# random_state=1 parametresi, her çalıştırdığımızda aynı sonucu almamız için bir "şans faktörünü" sabitler.
model = DecisionTreeClassifier(random_state=1)

In [16]:
# Modeli, X ve y verilerimizi kullanarak EĞİT
model.fit(X, y)

print("KÂHİN EĞİTİLDİ!")
print("Model, Titanic'teki 'kimin kurtulduğu' örüntüsünü öğrendi.")

KÂHİN EĞİTİLDİ!
Model, Titanic'teki 'kimin kurtulduğu' örüntüsünü öğrendi.

In [17]:
# Modelden, X verisine bakarak TAHMİN yapmasını iste
predictions = model.predict(X)

# Şimdi modelin tahminleri (predictions) ile gerçek cevapları (y) karşılaştıralım
from sklearn.metrics import accuracy_score

accuracy = accuracy_score(y, predictions)

print("--- MODEL BAŞARI RAPORU ---")
print(f"Modelimizin 'train.csv' üzerindeki başarı oranı (Accuracy): {accuracy * 100:.2f}%")

--- MODEL BAŞARI RAPORU ---
Modelimizin 'train.csv' üzerindeki başarı oranı (Accuracy): 87.99%

In [24]:
# test.csv dosyasını YENİ bir dataframe'e yükleyelim
test_df = pd.read_csv('data/test.csv')

# Hızlıca bir bakalım (Dikkat: Bu tabloda 'Survived' sütunu YOK)
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [19]:
# 1. Yaş sütunundaki boşlukları DOLDUR
# DİKKAT: test_df'in kendi ortalamasını KULLANMIYORUZ.
# Bu bir "kopya çekmek" olurdu.
# Kâhin'i eğitirken kullandığımız aynı 'ortalama_yas' değerini kullanmalıyız.
test_df['Age'] = test_df['Age'].fillna(ortalama_yas)

# 2. Cinsiyet sütununu TERCÜME ET (1/0)
test_df['Sex_numeric'] = test_df['Sex'].map({'female': 1, 'male': 0})

# Kontrol: test verisi hazır mı? (Evet)
print("Test verisi Kâhin'in anlayacağı dile çevrildi.")
test_df.head()

Test verisi Kâhin'in anlayacağı dile çevrildi.

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_numeric
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [20]:
# Eğitimde kullandığımız 'features' listesini tekrar kullanalım
# features = ['Pclass', 'Age', 'Sex_numeric'] (bunu zaten tanımlamıştık)

# test_df'ten SADECE bu özellikleri (X_test) seçelim
X_test = test_df[features]

# --- İŞTE O AN: KÂHİNLİK ---
# EĞİTİLMİŞ modelimizi kullanarak X_test verisi için TAHMİN yap
test_predictions = model.predict(X_test)

# Tahminlere bakalım (0 = Öldü, 1 = Kurtuldu)
print("--- TAHMİN SONUÇLARI (İLK 20 YOLCU) ---")
print(test_predictions[:20])

--- TAHMİN SONUÇLARI (İLK 20 YOLCU) ---
[0 0 1 1 1 0 0 0 0 0 0 0 1 1 1 1 0 0 1 0]

In [21]:
# Tahminlerimizi, test_df'teki 'PassengerId' ile birleştirelim
submission = pd.DataFrame({
    "PassengerId": test_df["PassengerId"],
    "Survived": test_predictions
})

# Çıktıya bakalım, tam istediğimiz gibi mi?
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         1
3          895         1
4          896         1

In [22]:
# Bu tabloyu bir .csv dosyası olarak kaydedelim
# index=False önemlidir, yoksa 0,1,2,3.. diye fazladan bir sütun ekler
submission.to_csv('titanic_submission.csv', index=False)

print("--- BAŞARILI! ---")
print("Tahmin raporunuz 'titanic_submission.csv' adıyla klasörünüze kaydedildi.")

--- BAŞARILI! ---
Tahmin raporunuz 'titanic_submission.csv' adıyla klasörünüze kaydedildi.